type Additional = {
  name?: string
  descrption: Array<string>
}

export const sideSkills: Array<Additional> = [
  {
    name: "Разработка no-code приложений",
    descrption: [
      "Разработала персональные приложения на базе Google AppSheet:",
      "- приложение для ведения семейного раздельного бюджета с возможностью просмотра аналитики трат по категориям и с расчетом задолжностей партнеров;",
      "- мини-словарь армянского языка с ручным заполнением.",
    ]
  },
  {
    name: "Опыт написания скриптов Google Apps Script",
    descrption: [
      "Написала набор скриптов на JavaScript + Google Apps Script для автоматизации работы с приложениями Google (выгрузка / загрузка отчетов и их обработка).",
      "Написала пользовательскую функцию по форматированию времени (из формата ЧЧ:ММ в десятичное число).",
    ]
  },
  {
    name: "Организация, систематизация и документация процессов",
    descrption: [
      "Адаптировала и внедрила CRM-систему на базе Битрикс24 для онлайн-школы. Написала сопроводительную документацию для менеджеров (описание базовых инструментов портала и их адаптация под нужды отдела).",
      "Разработала пайплайн работы технического художника (подготовка графических файлов для последующей анимации или импорта в игровой движок). Подготовила инструкцию, провела обучение исполнителей и успешно делегировала дальнейший контроль над работой.",
      "Подготовила канбан-доску с автоматизацией, адаптированную под процессы продакшн-отдела.",
      "Написала стайл-гайд для разработки визуального контента мобильной игры.",
    ]
  },
  {
    name: "Владение графическими редакторами",
    descrption: [
      "Adobe Photoshop на профессиональном уровне (как 2D-художник).",
      "Figma на уровне создания типовых макетов.",
    ]
  },
  {
    name: "Знание колористики, композиции и основ  графического дизайна",
    descrption: [
      "Имею специальность “дизайнер архитектурной среды”, три года работала в арт-студии на позиции middle 2D художник. Хорошо чувствую композицию и имею развитый художественный вкус.",
    ]
  },
  {
    name: "Английский язык уровня Upper-Intermediate",
    descrption: [
      "Свободно читаю техническую документацию и смотрю обучающие видео на английском языке.",
    ]
  },
]

export const softSkills: Array<Additional> = [
  {
    name: "Обучаемость",
    descrption: [
      "Инициативно и самостоятельно изучила основы и тонкости работы с платформой Битрикс24 и с Google приложениями (в т.ч. как писать скрипты на Apps Script).",
      "С нуля за год обучилась фронтенд-разработке.",
    ]
  },
  {
    name: "Аналитическое мышление",
    descrption: [
      "Стараюсь рассмотреть разные варианты решения задачи и выбрать наиболее оптимальный.",
      "Даже для такой обыденной задачи, как выбор отеля, я составляю табличку с указанием важных для меня параметров (цена, расположение, условия проживания, рейтинги на разных сервисах). Для нечисловых параметров я использую балльную систему оценки. Дальнейшее автоматическое условное форматирование помогает выбрать наилучший вариант, основываясь на совокупности всех факторов.",
    ]
  },
  {
    name: "Структуризация данных",
    descrption: [
      "Написала аналитическую таблицу (Google Spreadsheet) для аналитики доходов с продаж и успешности продуктов студии.",
      "Создала набор аналитических таблиц (Google Spreadsheet) для отслеживания окупаемости проектов на основе зарплат исполнителей, потраченных человеко-часов и полученной выручки.",
      "Разработала систему фильтрации и каталогизации продуктов компании, которая позволяет быстро находить необходимый товар (на базе Notion).",
    ]
  },
  {
    name: "Самостоятельность и ответственность",
    descrption: [
      "Всегда сначала сама ищу ответ на вопрос, прежде чем обратиться за помощью.",
      "Если задача не решается - стараюсь найти альтернативные варианты ее решения.",
      "Тщательно оцениваю свою работу по всем критериям, прежде чем отдать ее на проверку.",
    ]
  },
  {
    name: "Дисциплинированность",
    descrption: [
      "Около года занималась самообучением веб-разработке, уделяя на это регулярно четыре часа по будням и два часа по выходным (с заранее запланированными перерывами на отпуск).",
      "Раз в неделю на протяжении более трех лет занимаюсь английским с репетитором.",
      "Придерживаюсь одного и того же распорядка дня даже при возможности гибкого рабочего графика.",
      "Не откладываю задачи на потом, даже если они неинтересные.",
    ]
  },
  {
    name: "Навык предоставления обратной связи",
    descrption: [
      "Была лид-художником на двух проектах (в задачи помимо фидбэка исполнителям входило оценка трудоемкости задач, их распределение между исполнителями и контроль качества иллюстраций).",
    ]
  },
  {
    descrption: [
      "А также целеустремленность, усидчивость и внимание к деталям.",
    ]
  }
]
